import 'package:flutter_test/flutter_test.dart';
import 'package:newsfeed_mobile/models/Feed.dart';

void main(){
  test("test parse json", (){
    var json = {
        "id": 188,
        "title": "“我们都是香港人” 少数族裔和多元文化成为抗议风潮新焦点",
        "link": "https://www.bbc.com/zhongwen/simp/chinese-news-50125713",
        "cover": "https://ichef.bbci.co.uk/news/800/cpsprodpb/83AF/production/_109311733_screenshot2019-10-21at6.54.24pm.png",
        "news_publisher": {
            "id": 1,
            "name": "BBC Chinese"
        },
        "content": "![](https://ichef.bbci.co.uk/news/320/cpsprodpb/83AF/production/_109311733_screenshot2019-10-21at6.54.24pm.png)\n\n\n\n以南亚和东南亚裔为主的香港少数族裔原本在这次因修订《逃犯条例》而触发的示威浪潮中并非主要角色。然而，近日曾多次组织游行的民间人权阵线（简称“民阵”）召集人岑子杰遭遇袭击受伤后，有网络传闻说袭击者是当地少数族裔人士，令这个仅占香港人口1%的族群立刻成为新闻焦点。\n\n    \n        \n\n民阵召集人岑子杰遇袭后，网络讨论一度传出要冲击少数族裔聚居的地点：位于九龙区市中心的重庆大厦、甚至附近的清真寺等，但讨论方向很快改变，指出不应因小部份人的行动，而怪罪整个社区群体。\n据报，警方已经就袭击事件拘捕3人，但没有提及被捕人士的族裔。\n\n    \n        \n\n周日（10月20日），当数以千计香港市民不顾警方反对坚持示威游行，继续要求香港政府成立独立委员会调查示威浪潮、落实“真普选”等“五大诉求”时。一些南亚和东南亚裔香港少数族群人士趁机会，主动向示威人群派发瓶装水和食物，展示团结友善，获许多在场人士欢呼支持。\n一些参加派发瓶装水活动的少数族群居民说，希望透过这次机会，向香港华裔居民展示双方的团结。\n\n- \n \n-  [香港外籍“男佣”：少数中的少数](https://www.bbc.com/zhongwen/simp/world-48184843) \n\n-  [香港巴裔“最帅警员”启蒙少数族裔青年](https://www.bbc.com/zhongwen/simp/chinese-news-39958604) \n\n-  [香港观察：从尼泊尔人看香港少数族裔的处境](https://www.bbc.com/zhongwen/simp/hong_kong_review/2015/04/150428_hkreview_nepalese) \n\n-  [在香港怀孕的外籍帮佣  留下来的路有多难](/zhongwen/simp/chinese-news-48995755) \n\n\n            \n                \n                \n                None\n\n\n\n## “我们都是香港人”\nBBC中文记者现场观察，十多名少数族群市民在重庆大厦大门向参加游行途经的人士派发瓶装水，又以广东话和英语向在场人士问好，高呼“我们都是香港人”。游行人士偶然会拍掌支持，又高喊示威口号回应。\n派发瓶装水包括一名香港脱口秀艺人Vivek Mahbubani（别名“阿V”）。他是印度移民第三代，在香港出生和长大，说得一口流利的广东话。\n他向BBC中文记者表示，他在[岑子杰遇袭后](https://www.bbc.com/zhongwen/simp/chinese-news-50076863) \n“我觉得今天是一个很好的机会提醒大家，香港其实什么人都有，不用害怕肤色不同、政见不同。”\n蒙泰萝（Zamira Monteiro）也参加派发瓶装水的活动。她在香港一家协助外藉家务助理维权的非政府组织工作多年。她说希望透过参加活动证明，不论肤色、宗教或政见都可以站在一起，“让其他人知道香港有许多不同族群的人聚居，我觉得这样很好”。\n\n            \n                \n                \n                None\n\n\n香港最多的少数族群主要是来自菲律宾和印尼的家务助理，他们大多只是短期在香港打工，合约完结就会离开香港。但也有不少来自印度、巴基斯坦、尼泊尔等地移民的后代。\n香港主权移交之前，许多印度、巴基斯坦家族到香港经营公司，港英政府也在尼泊尔等地招聘廓尔喀人加入警队或驻守香港的英军，许多家庭自此在香港扎根。香港政府统计处2016年发表的中期人口调查显示，香港人口约1%为印度、巴基斯坦和尼泊尔裔（统计处统称这些族群为“南亚裔人士”）。\n这些少数族群大多有香港永久性居民身份，社会福利和工作的权利与一般华裔居民大致无异，但是他们在许多地方仍然无法融入香港的生活，例如大部分南亚裔人士都无法阅读中文，令他们在找工作和求学的过程都遇到不少挑战，只能做一些体力劳动的工作。\n\n            \n                \n                \n                None\n\n\n\n            \n                \n                \n                None\n图片版权\nReuters\n\n\n香港政府早年为了让这些少数族群融入社会，在当地的小学和中学推出一些课程让少数族群除了学习自身的语言外，还能学习中文作为第二语言。\n当地一个年青组织2016年的调查发现，超过一半受访者从未与少数族裔接触，他们对少数族裔的印象也普通。岑子杰袭击者被指是南亚裔人士后的反弹，正好反映了这种印象。\n蒙泰萝也承认，少数族群给外界的印象也许不太好，但向游行人士派发瓶装水的做法正好向外界宣布，少数族群是“善良、热情的，也向外界显示他们也是香港人”。\n\n- \n \n-  [在香港怀孕的外籍帮佣  留下来的路有多难](/zhongwen/simp/chinese-news-48995755) \n\n-  [港女恋上“非洲难民”面对的歧视与挣扎](/zhongwen/simp/indepth-43821714) \n\n-  [香港帅哥警员乡音拯救欲轻生巴基斯坦人](/zhongwen/simp/chinese-news-39269446) \n\n-  [穆斯林在香港：中港两地面临不同挑战](/zhongwen/simp/chinese-news-39124578) \n\nNone\n    \n        \n            [跳过 Facebook 帖子  用户名 BBC 中文網（繁體）](#jump-linkhttps://www.facebook.com/bbcnewstrad/videos/2437117793169331/) None\n结尾 Facebook 帖子  用户名 BBC 中文網（繁體）\n\n\n\n\n\n## 理性讨论\n《逃犯条例》引发的示威浪潮香港引起很大争议，造成社会许多分化，这在少数族裔族群也不例外。\n一些少数种族的领袖曾经在不同的公开场合，发表对香港示威浪潮的看法。这包括印度协会前主席毛汉（Mohan Chugani），他曾参加[建制组织7月举行的“守护香港集会”](https://www.bbc.com/zhongwen/simp/chinese-news-49110377) \n他周日在九龙清真寺外，被警方水炮车射出的蓝色颜料水射中。他之后接受香港媒体访问时说十分不满警方的做法，因为当时清真寺外已经没有示威者，又说7月出席“守护香港集会”，是期望香港回复和平，并不代表支持警察。\nNone\n    \n        \n            [跳过 Facebook 帖子 2 用户名 BBC 中文網（繁體）](#jump-linkhttps://www.facebook.com/bbcnewstrad/videos/408124236767707/) None\n结尾 Facebook 帖子 2 用户名 BBC 中文網（繁體）\n\n\n\n\n阿V接受BBC中文访问时坦言，他身边也有朋友批评示威浪潮扰乱生活。他说他会尊重对方想法的同时，也会希望了解对方的想法。“我不会说你的想法是对是错，我只是想知道你的逻辑为什么会走到这个地步。”\n蒙泰萝也说，她有许多朋友对示威浪潮也有不同的想法，但大家都能以一个理性的态度讨论事情。\n“这也是我希望香港能做到的事情，就是能够在不同的社区群体建立信任，以一个理性态度讨论这些议题。”",
        "sentiment": 0.510152280330658,
        "posted_time": "2019-10-22T06:54:32.088871Z",
        "publisher": 1
    };

    Feed feed =  Feed.fromJson(json);
    expect(188, feed.id);
    expect(feed.publisher.name, "BBC Chinese");
  });
}